# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [3]:
import warnings
warnings.simplefilter('ignore')  


import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import pandas as pd
pd.set_option('display.max_columns', None)

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [4]:
# your answer here
temp=pd.read_csv('Temp_States.csv')

temp.columns=[c.lower().replace(' ', '_') for c in temp.columns]

#### Print `temp`

In [5]:
temp.head()

         city        state  temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [6]:
# your answer here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         7 non-null      object
 1   state        7 non-null      object
 2   temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

#### Select the rows where state is New York

In [7]:
# your answer here
nyork=temp.loc[temp.state == 'New York']
nyork

      city     state  temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [8]:
# your answer here
nyork.mean()

temperature    10.740741
dtype: float64

#### We want to know cities and states with Temperature above 15 degress Celcius

In [9]:
# your answer here
cities= temp.loc[temp.temperature > 15]
cities

       city        state  temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [10]:
# your answer here
above_15= temp.city.loc[temp.temperature>15]
above_15

0         NYC
3    Hartford
5      Treton
6      Newark
Name: city, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [11]:
# your answer here
temp.loc[(temp.temperature > 15) & (temp.temperature < 20) ]

       city        state  temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [14]:
# your answer here
temp.groupby(str['state']).temperature()

TypeError: 'type' object is not subscriptable

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [15]:
# your answer here
employee=pd.read_csv('employee.csv')

employee.columns=[c.lower().replace(' ', '_') for c in employee.columns]
employee.head()

     name department education gender      title  years  salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the Temp dataframe. Comment your results

In [16]:
# your answer here
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        9 non-null      object
 1   department  9 non-null      object
 2   education   9 non-null      object
 3   gender      9 non-null      object
 4   title       9 non-null      object
 5   years       9 non-null      int64
 6   salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

#### What's the average salary in this company?

In [17]:
# your answer here
employee.salary.mean()

48.888888888888886

#### What's the highest salary?

In [18]:
# your answer here
employee.salary.max()

70

#### What's the lowest salary?

In [19]:
# your answer here
employee.salary.min()

30

#### Who are the employees with the lowest salary?

In [20]:
# your answer here
employee.loc[employee.salary == 30]

    name department education gender    title  years  salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Could you give all the information about an employee called David?

In [21]:
# your answer here
David= employee.loc[employee.name == 'David']
David

    name department education gender    title  years  salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [22]:
# your answer 
David.iloc[0][-1]

30

#### Print all the rows where job title is associate

In [23]:
# your answer here
employee.loc[employee.title == 'associate']

     name department education gender      title  years  salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [24]:
# your answer here- 1 method
employee.iloc[:3]

    name department education gender    title  years  salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [25]:
# your answer here- 2nd method
employee.head(3)

    name department education gender    title  years  salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees who's title is associate and the salary above 55?

In [26]:
# your answer here
condicion=employee.loc[(employee.title=='associate') & (employee.salary > 55)]
condicion

    name department education gender      title  years  salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [27]:
# your answer here
employee.groupby(['years']).mean()

          salary
years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average Salary per title?

In [28]:
# your answer here
employee.groupby(['title']).mean()

           years     salary
title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [29]:
# print first quartile here

employee.describe()

          years     salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [32]:
# print third quartile here

#### Is the mean salary per gender different?

In [31]:
# your answer here
employee.groupby(['gender']).salary.mean()

gender
F    47.5
M    50.0
Name: salary, dtype: float64

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [33]:
# your answer here
employee.describe()

          years     salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [ ]:
# your answer here

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [ ]:
# your answer here

In [ ]:
# your answer here

####  What is the average Purchase Price?

In [ ]:
# your answer here

#### What were the highest and lowest purchase prices?

In [ ]:
# your answer here

In [ ]:
# your answer here

#### Select all the customers we have in Spain

In [ ]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [ ]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [ ]:
# your answer here

#### Select orders from Spain that are above 50 items

In [ ]:
# your answer here

#### Select all free orders

In [ ]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [ ]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [ ]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here